In [ ]:
#Skill No : 5
#Title : Based on Python Database
#Name : Snehal Gawade
#PRN : 2401208025

1. Create a Python program to create table Employee and Department as follows:
Employee: E_ID, NAME, AGE, SALARY, D_ID
Department: D_ID, DNAME
Add sufficient records in both the tables. Display the records of those employees, who
is working in Sales department and Age is between 30 and 40.

In [49]:
import mysql.connector

In [61]:
myconn = mysql.connector.connect(
    host="localhost",
    user="root",
    passwd="Snehal@12345",
    auth_plugin="mysql_native_password"
)

In [63]:
cur = myconn.cursor()

In [65]:
myconn = mysql.connector.connect(
    host="localhost",
    user="root",
    passwd="Snehal@12345",
    database="sneh")

In [67]:
cur = myconn.cursor()

In [69]:
cur.execute("use sneh")

In [ ]:
dbs = cur.execute("CREATE TABLE Department1(D_ID INTEGER PRIMARY KEY,DNAME TEXT NOT NULL)")

In [87]:
for i in range(2):
    D_ID = int(input("Enter Department ID: "))
    DNAME = input("Enter Department Name: ")
    rec = (D_ID, DNAME)
    cur.execute("INSERT INTO Department1 (D_ID, DNAME) VALUES (%s,%s)", rec)
    myconn.commit()

Enter Department ID:  601
Enter Department Name:  Sales
Enter Department ID:  410
Enter Department Name:  Sales

In [89]:
cur.execute("select * from Department1")
result= cur.fetchall()
for x in result:
    print(x)

(101, 'DA')
(102, 'DS')
(201, 'CS')
(410, 'Sales')
(501, 'IT')
(502, 'DE')
(601, 'Sales')

In [37]:
dbs=cur.execute('''
CREATE TABLE Emp1 (
    E_ID INTEGER PRIMARY KEY,
    NAME varchar(20) NOT NULL,
    AGE INTEGER NOT NULL,
    SALARY float NOT NULL,
    D_ID INTEGER,
    FOREIGN KEY (D_ID) REFERENCES Department1(D_ID)
)
''')

In [91]:
for i in range(2):
    e_id = int(input("Enter Employee ID: "))
    name = input("Enter Employee Name: ")
    age = int(input("Enter Age: "))
    salary = float(input("Enter Salary: "))
    d_id = int(input("Enter Department ID: "))

    # Tuple to hold the record
    rec = (e_id, name, age, salary, d_id)

    # Insert the record into Employee1 table
    cur.execute("INSERT INTO Emp1 (E_ID, NAME, AGE, SALARY, D_ID) VALUES (%s,%s,%s,%s,%s)", rec)
    myconn.commit()

Enter Employee ID:  51
Enter Employee Name:  Rihan
Enter Age:  32
Enter Salary:  578749
Enter Department ID:  601
Enter Employee ID:  45
Enter Employee Name:  Soya
Enter Age:  37
Enter Salary:  976587
Enter Department ID:  410

In [93]:
cur.execute('''
    SELECT e.NAME, e.AGE, e.SALARY, d.DNAME 
    FROM Emp1 e 
    JOIN Department1 d ON e.D_ID = d.D_ID 
    WHERE d.DNAME = 'Sales' AND e.AGE BETWEEN 30 AND 40
''')

result = cur.fetchall()

# Loop through the result and print each record
for r in result:
    print(r)

('Soya', 37, 976587.0, 'Sales')
('Rihan', 32, 578749.0, 'Sales')

2. Create a Python program to accept and add student education details in MySQL
database table and display records of those students, who have secured first class in
graduation. Assume suitable table structure.

In [ ]:
dbs= cur.execute("CREATE TABLE stu(s_id INT PRIMARY KEY,name VARCHAR(255) NOT NULL,age INT,course VARCHAR(255), graduation_per FLOAT)" );

In [27]:
for i in range(2):
    sid= int(input("Enter Student ID:"))
    name= input("Enter Student Name:")
    age=int(input("Enter Age:"))
    course=input("Enter Course:")
    graduation_per= int(input("Enter Graduation percentage:"))
    rec= (sid,name,age,course, graduation_per)
    cur.execute("insert into stu(s_id,name,age,course, graduation_per)values(%s,%s,%s,%s,%s)",rec)
    myconn.commit()

Enter Student ID: 3
Enter Student Name: Riya
Enter Age: 25
Enter Course: 56
Enter Graduation percentage: 55
Enter Student ID: 4
Enter Student Name: Sam
Enter Age: 43
Enter Course: DA
Enter Graduation percentage: 65

In [29]:
cur.execute("select * from stu")
result= cur.fetchall()
for r in result:
    print(r)

(1, 'Snehal', 21, 'Data Science', 90.0)
(2, 'Tulsi', 22, 'Computer Science', 92.0)
(3, 'Riya', 25, '56', 55.0)
(4, 'Sam', 43, 'DA', 65.0)

In [31]:
# Display students who have secured first class in graduation (60% and above)
cur.execute("SELECT * FROM stu WHERE graduation_per >= 60")
result = cur.fetchall()
print("\nStudents who secured first class in graduation:")
for r in result:
    print(r)

Students who secured first class in graduation:
(1, 'Snehal', 21, 'Data Science', 90.0)
(2, 'Tulsi', 22, 'Computer Science', 92.0)
(4, 'Sam', 43, 'DA', 65.0)

3. Create a Python program to accept Book Details from user. Check if it is available in
database table Book.
If yes then display proper message, otherwise insert details in to Book table.

In [33]:
dbs=cur.execute("""
    CREATE TABLE Book (
        book_id INT PRIMARY KEY,
        title VARCHAR(255),
        author VARCHAR(255),
        genre VARCHAR(255),
        price FLOAT
    )
""")

In [49]:
for i in range(2):
    book_id= int(input("Enter Book ID:"))
    title= input("Enter Title Name:")
    author=input("Enter Author:")
    genre=input("Enter Genre:")
    price= float(input("Enter Price:"))
    rec= (book_id,title,author,genre,price)
    cur.execute("insert into Book(book_id,title,author,genre,price)values(%s,%s,%s,%s,%s)",rec)
    myconn.commit()

Enter Book ID: 4
Enter Title Name: To Kill a Mockingbird
Enter Author: Harper Lee
Enter Genre: Fiction
Enter Price: 50
Enter Book ID: 6
Enter Title Name: Power
Enter Author: J.J
Enter Genre: Dystopian
Enter Price: 86

In [51]:
cur.execute("select * from Book")
result= cur.fetchall()
for r in result:
    print(r)

(1, 'The Great Gatsby', 'F. Scott Fitzgerald', 'Fiction', 100.0)
(2, '1984', 'George Orwell', 'Dystopian', 111.0)
(4, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 50.0)
(6, 'Power', 'J.J', 'Dystopian', 86.0)

In [55]:
# Check if the book already exists in the database
cur.execute("SELECT * FROM Book WHERE book_id = %s", (book_id,))
result = cur.fetchall()

if result:
    print(f"Book with ID {book_id} already exists in the database.")
else:
# Insert the book details if not found in the database
    rec = (book_id, title, author, genre, price)
    cur.execute("INSERT INTO Book (book_id, title, author, genre, price) VALUES (%s, %s, %s, %s, %s)", rec)
    myconn.commit()
    print(f"Book '{title}' has been added to the database.")

Book with ID 6 already exists in the database.